# Homebrew Bundle
# Install with: brew bundle install

# ============================================================================
# Core Packages (Always Installed)
# ============================================================================

# Essential Tools
brew "chezmoi"         # Dotfile manager
brew "curl"            # HTTP client
brew "neovim"          # Modern vim

# Shell Enhancement
brew "oh-my-posh"      # Prompt theme engine
brew "antidote"        # ZSH plugin manager
brew "atuin"           # Better shell history

# Font Tools
brew "fontforge"       # Font editor and patcher

# System Monitoring
brew "htop"            # Interactive process viewer
brew "btop"            # Modern resource monitor
brew "nvtop"           # GPU process monitor

# Modern CLI Replacements
brew "bat"             # Better cat with syntax highlighting
brew "eza"             # Modern ls replacement
brew "ripgrep"         # Faster grep
brew "fd"              # Faster find
brew "fzf"             # Fuzzy finder

# File Utilities
brew "tree"            # Directory tree viewer
brew "jq"              # JSON processor
brew "yq"              # YAML processor
brew "tlrc"            # Simplified man pages (tldr client)

# Development Tools (Core)
brew "git"             # Version control
brew "gh"              # GitHub CLI
brew "age"             # Modern encryption tool for chezmoi secrets
brew "python@3.14"     # Python programming language

# Security & Secrets Management
brew "bitwarden-cli"   # Bitwarden password manager CLI

# ============================================================================
# Core Casks (Always Installed)
# ============================================================================

cask "font-hack-nerd-font"    # Nerd Font for terminals
cask "iterm2"                 # Terminal emulator

# ============================================================================
# Optional: AI Tools
# ============================================================================
{{- if .installAI }}

brew "codex"                  # OpenAI Codex CLI
brew "gemini-cli"             # Google Gemini CLI
cask "claude-code"            # Anthropic Claude coding assistant
{{- end }}

# ============================================================================
# Optional: Development Tools
# ============================================================================
{{- if .installDev }}

brew "podman"                 # Container engine
cask "visual-studio-code"     # Code editor
{{- end }}

# ============================================================================
# Optional: Productivity Apps
# ============================================================================
{{- if .installProductivity }}

cask "bettertouchtool"        # Customize trackpad and keyboard
cask "bitwarden"              # Bitwarden password manager GUI
cask "istat-menus"            # System monitoring and stats
cask "localsend"              # Local file sharing
cask "moom"                   # Window management
cask "standard-notes"         # Encrypted notes app
cask "syncthing-app"          # File synchronization
{{- end }}

# ============================================================================
# Optional: Browsers
# ============================================================================
{{- if .installBrowsers }}

cask "firefox"                # Web browser
{{- end }}
